Repository: XaMcTeRzzz/1privatclinic
Catalog: plugins/plugins/banner-slider/languages/banner-slider-*.po
Languages: ru_ru, uk

source: Banner Slider
ru_ru: Баннерный слайдер
uk: Банерний слайдер

source: Custom banner slider with clickable images and links
ru_ru: Кастомный баннерный слайдер с кликабельными изображениями и ссылками
uk: Кастомний банерний слайдер з клікабельними зображеннями та посиланнями

source: Banner slider settings
ru_ru: Настройки баннерного слайдера
uk: Налаштування банерного слайдера

source: Add images for the banner slider
ru_ru: Добавьте изображения для баннерного слайдера
uk: Додайте зображення для банерного слайдера

source: Add image
ru_ru: Добавить изображение
uk: Додати зображення

source: Image
ru_ru: Изображение
uk: Зображення

source: Link
ru_ru: Ссылка
uk: Посилання

source: URL for clicking on the image (leave empty if no link needed)
ru_ru: URL для перехода при клике на изображение (оставьте пустым, если ссылка не нужна)
uk: URL для переходу при кліку на зображення (залиште пустим, якщо посилання не потрібне)

source: Title
ru_ru: Заголовок
uk: Заголовок

source: Image title (for accessibility)
ru_ru: Заголовок изображения (для доступности)
uk: Заголовок зображення (для доступності)

source: Slider settings
ru_ru: Настройки слайдера
uk: Налаштування слайдера

source: Slider behavior settings
ru_ru: Настройки поведения слайдера
uk: Налаштування поведінки слайдера

source: Number of visible slides
ru_ru: Количество видимых слайдов
uk: Кількість видимих слайдів

source: Number of images visible at once (default: 3)
ru_ru: Количество изображений, видимых одновременно (по умолчанию: 3)
uk: Кількість зображень, видимих одночасно (за замовчуванням: 3)

source: Space between slides (px)
ru_ru: Отступ между слайдами (px)
uk: Відступ між слайдами (px)

source: Distance between images in pixels (default: 20)
ru_ru: Расстояние между изображениями в пикселях (по умолчанию: 20)
uk: Відстань між зображеннями в пікселях (за замовчуванням: 20)

source: Slider height (px)
ru_ru: Высота слайдера (px)
uk: Висота слайдера (px)

source: Slider container height in pixels (default: 300)
ru_ru: Высота контейнера слайдера в пикселях (по умолчанию: 300)
uk: Висота контейнера слайдера в пікселях (за замовчуванням: 300)

source: Enable autoplay
ru_ru: Включить автопрокрутку
uk: Увімкнути автопрокрутку

source: Automatically switch slides
ru_ru: Автоматически переключать слайды
uk: Автоматично перемикати слайди

source: Autoplay delay (ms)
ru_ru: Задержка автопрокрутки (мс)
uk: Затримка автопрокрутки (мс)

source: Time between automatic switches in milliseconds (default: 5000)
ru_ru: Время между автоматическими переключениями в миллисекундах (по умолчанию: 5000)
uk: Час між автоматичними перемиканнями в мілісекундах (за замовчуванням: 5000)

source: Show navigation buttons
ru_ru: Показывать кнопки навигации
uk: Показувати кнопки навігації

source: Show arrows for manual switching
ru_ru: Показывать стрелочки для ручного переключения
uk: Показувати стрілочки для ручного перемикання

source: Allow touch dragging
ru_ru: Разрешить перетаскивание касаниями
uk: Дозволити перетягування дотиками

source: Allow finger dragging on mobile devices
ru_ru: Разрешить перетаскивание пальцем на мобильных устройствах
uk: Дозволити перетягування пальцем на мобільних пристроях

source: Mobile images
ru_ru: Мобильные изображения
uk: Мобільні зображення

source: Separate images for mobile devices (if not filled, main images will be used)
ru_ru: Отдельные изображения для мобильных устройств (если не заполнены, будут использоваться основные изображения)
uk: Окремі зображення для мобільних пристроїв (якщо не заповнені, будуть використовуватися основні зображення)

source: Add mobile image
ru_ru: Добавить мобильное изображение
uk: Додати мобільне зображення

source: Mobile image
ru_ru: Мобильное изображение
uk: Мобільне зображення

source: Mobile image title
ru_ru: Заголовок мобильного изображения
uk: Заголовок мобільного зображення

source: Banner slider
ru_ru: Баннерный слайдер
uk: Банерний слайдер

source: Configure images and behavior of the banner slider
ru_ru: Настройте изображения и поведение баннерного слайдера
uk: Налаштуйте зображення та поведінку банерного слайдера

source: Usage
ru_ru: Использование
uk: Використання

source: To display the banner slider in the desired location, add the shortcode:
ru_ru: Для отображения баннерного слайдера в нужном месте добавьте шорткод:
uk: Для відображення банерного слайдера в потрібному місці додайте шорткод:

source: Or use in PHP code:
ru_ru: Или используйте в PHP коде:
uk: Або використовуйте в PHP коді:

source: Add images in the banner slider settings
ru_ru: Добавьте изображения в настройках баннерного слайдера
uk: Додайте зображення в налаштуваннях банерного слайдера

source: Banner image
ru_ru: Изображение баннера
uk: Зображення банера

source: Mobile banner image
ru_ru: Мобильное изображение баннера
uk: Мобільне зображення банера

source: Save settings
ru_ru: Сохранить настройки
uk: Зберегти налаштування
