<?php
$documents = $args['data'];
?>
<?php if (!$documents):
	?>
	<div class="c-table__body-wrap-noitems">
		<?php echo __('За вашим запитом результатів аналізів не знайдено', 'mz'); ?>
	</div>
<?php
else:
	$key = 1;
	foreach ($documents as $document):
		?>
		<div class="c-table__body-row" <?php if ($key > ITEMS_FOR_ONE_SHOW) echo 'style="display: none;"'; ?>>
			<div class="c-table__body-row-wrap">
				<div class="c-table__body-cell-date">
									<span
										class="c-table__body-cell-date-format-desktop"><?php echo date_i18n(__('d F Y'), strtotime($document['Date'])) ?></span>
					<span
						class="c-table__body-cell-date-format-mob"><?php echo date_format(date_create($document['Date']), 'd-m-Y') ?></span>
				</div>
				<div class="c-table__body-cell-operate"><?php echo $document['Title'] ?></div>
				<div class="c-table__body-cell-document">
					<?php
					//echo $document['Url']
					$document_url = base64_encode($document['Url']);
					?>
					<a class="c-table__body-cell-document-desktop"
					   href="javascript:openDocument('<?php echo $document['Name'] ?>.pdf','<?php echo $document_url ?>');"
					   title="<?php _e('Перегляд', 'mz'); ?>"><?php _e('Результат аналізів', 'mz'); ?></a>
					<div class="c-table__body-cell-document-mob">
						<a href="javascript:openDocument('<?php echo $document['Name'] ?>.pdf','<?php echo $document_url ?>');"
						   title="<?php _e('Перегляд', 'mz'); ?>">
							<svg width="24" height="24" viewBox="0 0 24 24" fill="none"
							     xmlns="http://www.w3.org/2000/svg">
								<path
									d="M19.7422 7.71819L14.4089 2.26365C14.3258 2.1794 14.2273 2.11274 14.119 2.0675C14.0107 2.02226 13.8948 1.99932 13.7778 2.00002H6.66666C5.95942 2.00002 5.28114 2.28735 4.78105 2.79881C4.28095 3.31028 4 4.00397 4 4.72729V19.2727C4 19.996 4.28095 20.6897 4.78105 21.2012C5.28114 21.7127 5.95942 22 6.66666 22H17.3333C18.0406 22 18.7188 21.7127 19.2189 21.2012C19.719 20.6897 20 19.996 20 19.2727V8.36365C20.0007 8.244 19.9782 8.1254 19.934 8.01464C19.8898 7.90388 19.8246 7.80314 19.7422 7.71819ZM14.6667 5.10001L16.9689 7.45456H14.6667V5.10001ZM18.2222 19.2727C18.2222 19.5138 18.1286 19.7451 17.9619 19.9156C17.7952 20.086 17.5691 20.1818 17.3333 20.1818H6.66666C6.43092 20.1818 6.20482 20.086 6.03813 19.9156C5.87143 19.7451 5.77778 19.5138 5.77778 19.2727V4.72729C5.77778 4.48618 5.87143 4.25495 6.03813 4.08446C6.20482 3.91397 6.43092 3.8182 6.66666 3.8182H12.8889V8.36365C12.8889 8.60475 12.9825 8.83598 13.1492 9.00647C13.3159 9.17696 13.542 9.27274 13.7778 9.27274H18.2222V19.2727ZM16.6667 14.4909C16.48 14.1909 15.9378 14.0455 15.0311 14.0455C14.6687 14.044 14.3065 14.0653 13.9467 14.1091C13.6755 13.9568 13.4142 13.7867 13.1644 13.6C12.5214 13.0217 12.0527 12.2681 11.8133 11.4273C11.8969 10.8462 11.9415 10.26 11.9467 9.67274V9.40001C11.9467 9.40001 11.9467 9.34547 11.9467 9.32728L12 9.27274C12.0338 9.16829 12.0433 9.05725 12.0279 8.94838C12.0125 8.83951 11.9725 8.7358 11.9111 8.64546C11.872 8.59855 11.8227 8.56174 11.7671 8.53805C11.7115 8.51435 11.6512 8.50443 11.5911 8.5091H11.3867C11.2 8.5091 11.0667 8.63637 10.9955 8.87274C10.9114 9.25753 10.8934 9.65435 10.9422 10.0455C10.9854 10.5386 11.0777 11.026 11.2178 11.5C10.9589 12.3209 10.6256 13.1152 10.2222 13.8727C9.88444 14.5576 9.55555 15.1636 9.23555 15.6909C9.22758 15.6717 9.2154 15.6546 9.19996 15.641C9.18451 15.6273 9.1662 15.6175 9.14645 15.6122C9.1267 15.6069 9.10603 15.6064 9.08603 15.6106C9.06603 15.6147 9.04724 15.6236 9.03111 15.6364C8.57436 15.8654 8.15945 16.1729 7.80444 16.5455C7.56244 16.772 7.38438 17.0608 7.28889 17.3818C7.27175 17.4368 7.26766 17.4951 7.27693 17.552C7.2862 17.6089 7.30858 17.6628 7.34222 17.7091H7.39555L7.61777 17.8182C7.6985 17.8573 7.78626 17.879 7.87555 17.8818C8.42666 17.8818 9.17333 17.0818 10.1156 15.4909C11.3049 15.0986 12.5332 14.8425 13.7778 14.7273C14.1636 14.9251 14.565 15.0893 14.9778 15.2182C15.324 15.3262 15.6826 15.3873 16.0444 15.4C16.4444 15.4 16.6667 15.2818 16.7022 15.0455C16.7637 14.9646 16.7941 14.8635 16.7875 14.7613C16.781 14.6591 16.738 14.5629 16.6667 14.4909ZM7.83111 17.3545C7.95356 17.1065 8.10912 16.877 8.29333 16.6727C8.53736 16.3912 8.80834 16.1354 9.10222 15.9091C8.79852 16.4886 8.36245 16.9845 7.83111 17.3545ZM11.52 8.94546C11.5975 9.03642 11.6415 9.15216 11.6444 9.27274C11.6396 9.29673 11.6396 9.32147 11.6444 9.34546C11.6 9.58183 11.5822 9.71819 11.5822 9.73637C11.5822 9.96365 11.52 10.0909 11.52 10.1364C11.4292 9.74483 11.4292 9.33701 11.52 8.94546ZM10.3733 14.9909C10.4622 14.8182 10.6044 14.5727 10.7911 14.2273C11.0917 13.6424 11.3473 13.0345 11.5555 12.4091C11.8341 13.0224 12.2336 13.5702 12.7289 14.0182L12.88 14.1455L12.9955 14.2273C12.0982 14.3891 11.2194 14.645 10.3733 14.9909ZM16.2044 14.8727C15.8111 14.8534 15.4236 14.7674 15.0578 14.6182C15.5019 14.5614 15.9526 14.6371 16.3555 14.8364L16.2044 14.8727Z"
									fill="#707E98"/>
							</svg>
						</a>
						<a href="javascript:downloadDocument('<?php echo $document['Name'] ?>.pdf','<?php echo $document_url ?>');"
						   title="<?php _e('Скачати', 'mz'); ?>">
							<svg width="24" height="22" viewBox="0 0 24 22" fill="none"
							     xmlns="http://www.w3.org/2000/svg">
								<path
									d="M2 11.0002H4V15.5835H20V11.0002H22V15.5835C22 16.601 21.11 17.4168 20 17.4168H4C2.9 17.4168 2 16.601 2 15.5835V11.0002ZM12 13.7502L17.55 8.74516L16.13 7.45266L13 10.3127V1.8335H11V10.3127L7.88 7.45266L6.46 8.75433L12 13.7502Z"
									fill="#707E98"/>
							</svg>
						</a>
						<a href="javascript:sendDocument('<?php echo $document['Name'] ?>.pdf','<?php echo $document_url ?>');"
						   title="<?php _e('Надіслати на пошту', 'mz'); ?>">
							<svg width="24" height="24" viewBox="0 0 24 24" fill="none"
							     xmlns="http://www.w3.org/2000/svg">
								<path
									d="M20 8L12 13L4 8V6L12 11L20 6V8ZM20 4H4C2.89 4 2 4.89 2 6V18C2 18.5304 2.21071 19.0391 2.58579 19.4142C2.96086 19.7893 3.46957 20 4 20H20C20.5304 20 21.0391 19.7893 21.4142 19.4142C21.7893 19.0391 22 18.5304 22 18V6C22 4.89 21.1 4 20 4Z"
									fill="#707E98"/>
							</svg>
						</a>
					</div>
				</div>
				<div class="c-table__body-cell-action">
					<ul>
						<li>
							<a href="javascript:downloadDocument('<?php echo $document['Name'] ?>.pdf','<?php echo $document_url ?>');"
							   title="<?php _e('Скачати', 'mz'); ?>">
								<svg width="24" height="22" viewBox="0 0 24 22" fill="none"
								     xmlns="http://www.w3.org/2000/svg">
									<path
										d="M2 11H4V15.5834H20V11H22V15.5834C22 16.6009 21.11 17.4167 20 17.4167H4C2.9 17.4167 2 16.6009 2 15.5834V11ZM12 13.75L17.55 8.74504L16.13 7.45254L13 10.3125V1.83337H11V10.3125L7.88 7.45254L6.46 8.75421L12 13.75Z"
										fill="#707E98"/>
								</svg>
							</a>
						</li>
						<li>
							<a href="javascript:sendDocument('<?php echo $document['Name'] ?>.pdf','<?php echo $document_url ?>');"
							   title="<?php _e('Надіслати на пошту', 'mz'); ?>">
								<svg width="24" height="24" viewBox="0 0 24 24" fill="none"
								     xmlns="http://www.w3.org/2000/svg">
									<path
										d="M20 8L12 13L4 8V6L12 11L20 6V8ZM20 4H4C2.89 4 2 4.89 2 6V18C2 18.5304 2.21071 19.0391 2.58579 19.4142C2.96086 19.7893 3.46957 20 4 20H20C20.5304 20 21.0391 19.7893 21.4142 19.4142C21.7893 19.0391 22 18.5304 22 18V6C22 4.89 21.1 4 20 4Z"
										fill="#707E98"/>
								</svg>
							</a>
						</li>
					</ul>
				</div>
			</div>
		</div>
		<div class="c-table__body-row-gap" <?php if ($key > ITEMS_FOR_ONE_SHOW) echo 'style="display: none;"'; ?>></div>
		<?php if ($key % ITEMS_FOR_ONE_SHOW == 0): ?>
		<div
			class="c-table__body-row show-more-row" <?php if ($key > ITEMS_FOR_ONE_SHOW) echo 'style="display: none;"'; ?>>
			<span id="js-show-more-button"><?php _e('Показати ще +', 'mz'); ?></span>
		</div>
	<?php endif; ?>
		<?php
		$key++;
	endforeach;
endif;
?>